'''
Пользователь вводит месяц в виде целого числа от 1 до 12.
Сообщить к какому времени года относится месяц (зима, весна, лето, осень).
Напишите решения через list и через dict.
'''

month = {
    1: "январь", 2: "февраль", 3: "март", 4: "апрель", 5: "май", 6: "июнь",
    7: "июль", 8: "август", 9: "сентябрь", 10: "октябрь", 11: "ноябрь", 12: "декабрь"
}
list_month = [
    "зима", "зима", "весна", "весна", "весна", "лето", "лето",
    "лето", "осень", "осень", "осень", "зима"
]

dict_month = {
    1: "зима", 2: "зима", 3: "весна", 4: "весна", 5: "весна", 6: "лето",
    7: "лето", 8: "лето", 9: "осень", 10: "осень", 11: "осень", 12: "зима",
}

while True:
    number = int(input('Введите месяц в виде числа от 1 до 12: '))
    if number > 12 or number < 1:
        print('Ошибка: введите номер месяца от 1 до 12!')
    else:
        # через list
        sessons = list_month[number - 1]

        # через dict

        sessons = dict_month[number]
        print(f'Что такое {month[number]}? Это {sessons}!')
        break
